{
    "projects": [
        {
            "id": 6,
            "Title": "Career App",
            "Description": "Webpage focused on FORD itself, where ford employees can plan your career inside the company. Is a platform where leaders have access to people past assessments and see how them are progressing or what should they do to perfom better. Back-end made in Java/SpringBoot and Front-end made in Angular. My work was focused on pages and components creation, http services creation, interfaces for the application, Deploy conducted inside FORD platform and access by internal VPN.",
            "Links": [
                 {"label": "GitHub",
                 "url": "Enterprise GitHub"}
             ],
            "Images": [],
            "Tags": ["#angular", "#java", "#springboot"]
        },
       {
        "id": 5,
           "Title": "LSAT",
           "Description": "LSAT is a platform created by FORD. It is used internally to measure, identify and conect people by their skill. It had no back-end integrated to it, uses a Microsoft Sharepoint service, where all data is stored in lists. Front-end made in Angular, my work in this project was a application refactor focused on better performance, bug fixes and new features. Features implemented: mailto administrator, form control for new skill groups, project page where you can subscribe and the system will calculate your fit to the project.",
           "Links": [
               {"label": "GitHub",
                "url": "Enterprise GitHub"}
           ],
           "Images": [],
           "Tags": ["#angular", "#sharepoint"]
       },
       {
        "id": 4,
           "Title": "Cubos Food",
           "Description": "Final Project on Cubos Academy course, where we created a solution to connect restaurants and consumers. Restaurants needed a proper sign up and login page, edit its information, profile creation, create menu with photo storage, and an order control so they could check all consumers orders. Consumers have a proper sign up and login page, profile creation, search for food or restaurants, make multiple orders with bill calculations. Back-end REST-api with node.js and Postgre as database, Front-end made with React using materialUI components, and using Agile method with 1 week sprints. Project conduted in 5 weeks.",
           "Links": [
                {"label": "Back-end GitHub",
                "url": "https://github.com/vnsl/Back-end-B4L"},
                {"label": "Back-end Consumers GitHub",
                "url": "https://github.com/vnsl/Back-end-B4L-consumidores"},
                {"label": "Front-end GitHub",
                "url": "https://github.com/vnsl/Front-end-B4L"}
            ],
           "Images": ["images/CubosFood/photo1.png", "images/CubosFood/photo2.png", "images/CubosFood/photo3.png", "images/CubosFood/photo4.png", "images/CubosFood/photo5.png", "images/CubosFood/photo6.png", "images/CubosFood/photo7.png", "images/CubosFood/photo8.png", "images/CubosFood/photo9.png", "images/CubosFood/photo10.png", "images/CubosFood/photo11.png"],
           "Tags": ["#react", "#node", "#postgress"]
       },
       {
        "id": 3,
           "Title": "Market Cubos",
           "Description": "Project made on Cubos Academy course. E-commerce webpage where stores can sign up and login in order to show their products and sell it. Back-end REST-api with node.js and Postgres as database, Front-end made with React using materialUI components, error handling and react-router-dom.",
           "Links": [
               {"label": "GitHub",
                "url": "https://github.com/vnsl/desafio-modulo-03"}
           ],
           "Images": ["images/MarketCubos/photo1.png", "images/MarketCubos/photo2.png", "images/MarketCubos/photo3.png", "images/MarketCubos/photo4.png", "images/MarketCubos/photo5.png", "images/MarketCubos/photo6.png", "images/MarketCubos/photo7.png"],
           "Tags": ["#react", "#node"]
       },
       {
        "id": 2,
           "Title": "Cubos Flix",
           "Description": "A challenge made in Cubos Academy course, which consist in a Film catalog where you can see film description, put them on a bag and see its final price, apply a discount within the time limit, and apply different filters. Front-end made with React.",
           "Links": [
                {"label": "GitHub",
                "url": "https://github.com/vnsl/cubos-flix"}
            ],
           "Images": ["images/CubosFlix/photo1.png", "images/CubosFlix/photo2.png"],
           "Tags": ["#react"]
       },
       {
           "id": 1,
           "Title": "Cubos Checkout",
           "Description": "A Back-end challenge made in Cubos Academy course, focused on the creation of a REST-api for comercialized products. Manipulate and check inventory.",
           "Links": [
                {"label": "GitHub",
                "url": "https://github.com/vnsl/cubos-checkout"}
             ],
           "Images": [],
           "Tags": ["#node"]
       }
       
    ]
}